package utils;

import com.example.pizzarecepies.PizzaRecipeModel;
import com.example.pizzarecepies.R;

import java.util.ArrayList;
import java.util.List;

public class GenerateData {

    private static String makeDough = "Смешайте 3 3/4 ст. муки и 1,5 ч. л. соли. Сделайте углубление и добавьте 1 и 1/3 ст. теплой воды, столовую ложку сахара и 1 уп. дрожжей. Когда образуется пена, подмешайте 3 ст. л. оливкового масла, вымесите до гладкости в течение 5 мин. Смажьте тесто оливковым маслом, положите в миску, накройте и дайте подняться в два раза, примерно 1 ч. 30 мин. Разделите тесто на два шара весом 450 гр. Если нет других указаний, используйте для рецепта 450 гр. теста.";

    public static List<PizzaRecipeModel> generatePizzaRecipeList() {
        List<PizzaRecipeModel> data = new ArrayList<>();
        data.add(new PizzaRecipeModel("Пицца Маргаритта",
                                      makeDough,
                                      "Растяните тесто в два тонких круга диаметром 23 см. Смажьте каждую основу 1/2 ст. протертых томатов (лучше Сан марцано), посыпьте сушеным орегано, солью, перцем, сбрызните оливковым маслом и выпекайте до золотистого цвета. Посыпьте 225 гр. нарезанной кубиками моцареллы, порванными кусочками листьями базилика и солью. Выпекайте, пока сыр не расплавится, затем сбрызните оливковым маслом.",
                                      R.drawable.margaritta));
        data.add(new PizzaRecipeModel("Пицца 4-е сезона",
                                      makeDough,
                                      "Приготовьте пиццу «Маргарита». Перед тем как добавлять сыр, выложите оливки, сердцевины артишоков, ветчину и обжаренные грибы: разную начинку на четыре секции.",
                                      R.drawable.four_seasons));
        data.add(new PizzaRecipeModel("Пицца Пеперони с грибами",
                                      makeDough,
                                      "Распределите тесто на смазанной маслом форме для пиццы диаметром 38 см. Сбрызните оливковым маслом, выложите сверху 1/2 ст. томатного соуса и 2 ст. крупно натертой моцареллы. Запеките, затем посыпьте сыром пекорино, сушеным орегано и сбрызните оливковым маслом. Перед запеканием выложите сверху обжаренные грибы и нарезанную кружочками салями пепперони.",
                                      R.drawable.peperony_mushroom));
        data.add(new PizzaRecipeModel("Пицца в нью-йоркском стиле",
                                      makeDough,
                                      "Распределите тесто на смазанной маслом форме для пиццы диаметром 38 см. Сбрызните оливковым маслом, выложите сверху 1/2 ст. томатного соуса и 2 ст. крупно натертой моцареллы. Запеките, затем посыпьте сыром пекорино, сушеным орегано и сбрызните оливковым маслом.",
                                      R.drawable.default_img));
        data.add(new PizzaRecipeModel("Пицца с завернутыми краями",
                                      makeDough,
                                      "Приготовьте «Пиццу в нью-йоркском стиле», но перед тем, как выкладывать начинку, положите 8 кусочков сыра, нарезанного палочками, вдоль края основы и заверните их в тесто. Украсьте ломтиками томата, и яйцом. Запеките до готовности яйца. Смажьте основу оливковым маслом и посыпьте сушеным орегано.",
                                      R.drawable.pizza_round_corners));
        data.add(new PizzaRecipeModel("Пицца с фрикадельками",
                                      makeDough,
                                      "Сформируйте тесто в смазанной маслом форме для пирога размером 38х15 см. Сбрызните оливковым маслом, смажьте 1/2 ст. томатного соуса и выложите 170 гр. моцареллы. Выпекайте, пока основа не станет хрустящей, выложите нарезанные кружочками готовые фрикадельки, посыпьте сыром пекорино, базиликом и сбрызните оливковым маслом. Запекайте, пока пицца не подрумянится.",
                                      R.drawable.meatballs));
        data.add(new PizzaRecipeModel("Пицца с мясом и оливками",
                                      makeDough,
                                      "Приготовьте Пиццу с фрикадельками. Добавьте вместе с сыром моцарелла фарш 2 раскрошенных сырых итальянских колбасок для жарки и 1/3 ст. нарезанных оливок каламата.",
                                      R.drawable.default_img));
        data.add(new PizzaRecipeModel("Пицца по-сицилийски",
                                      makeDough,
                                      "Сформируйте тесто на смазанном маслом противне с бортами. Накройте и оставьте на расстойку до увеличения в объеме в два раза. Смажьте 3/4 ст. томатного соуса, посыпьте 2 ст. крупно натертой моцареллы, сбрызните оливковым маслом и запеките.",
                                      R.drawable.default_img));
        data.add(new PizzaRecipeModel("Пицца с травами",
                                      makeDough,
                                      "Растяните тесто в круг диаметром 38 см. Сбрызните оливковым маслом, посыпьте солью, нарезанным тимьяном и орегано. Выпекайте, пока основа не станет хрустящей, затем еще раз смажьте оливковым маслом.",
                                      R.drawable.default_img));
        data.add(new PizzaRecipeModel("Пицца с фенхелем и таледжио",
                                      makeDough,
                                      "Приготовьте «Пиццу с травами». Перед запеканием выложите сверху обжаренный фенхель, 170 гр. сыра таледжио, 2 ст. л. нарезанного фундука и натертый сыр пекорино.",
                                      R.drawable.default_img));
        data.add(new PizzaRecipeModel("Пицца с тыквой и перцем",
                                      makeDough,
                                      "Растяните тесто в прямоугольник размером 38х23 см. Выложите сверху измельченный чеснок, тонкие ломтики кабачка цуккини, сбрызните пиццу оливковым маслом и посыпьте хлопьями красного перца. Запекайте, пока пицца не станет хрустящей.",
                                      R.drawable.default_img));
        data.add(new PizzaRecipeModel("Пицца с вонголе",
                                      makeDough,
                                      "Растяните тесто в прямоугольник размером 38х23 см. Посыпьте орегано и выложите 110 гр. нарезанной ломтиками моцареллы. Запекайте, пока основа не станет хрустящей. Выложите сверху 225 гр. нарезанных консервированных моллюсков вонголе и еще 1 ст. крупно натертой моцареллы. Запекайте, пока сыр не расплавится.",
                                      R.drawable.vongole));

        return data;
    }
}
